import Navigation from '../organisms/Navigation';

import './about.scss';

const About = () => {
    return (
        <>
            <Navigation />
            <div className="container-aboutus">
                <img src={require('../../assets/images/about_page.jpg')} alt="aboutIcon" />
                <span>Aquapeak – це компанія, яка займається продажем свіжої, якісної риби. Наша мета – надати нашим клієнтам широкий вибір свіжих морепродуктів найвищої якості. Ми працюємо тільки з перевіреними постачальниками, щоб гарантувати свіжість та якість нашої продукції.</span>
                <span>Ми пропонуємо широкий асортимент риби, від лосося та тунця до креветок та устриць. Вся наша продукція проходить ретельний контроль якості та відповідає всім стандартам безпеки харчових продуктів.</span>
                <span>Крім того, Aquapeak гарантує своїм клієнтам швидку та надійну доставку по всій країні. Наша команда професійних співробітників забезпечує найкращий сервіс, допомагаючи нашим клієнтам вибрати найбільш підходящі продукти та надаючи їм необхідну інформацію про нашу продукцію.</span>
                <span>Ми пишаємось нашим досвідом та професіоналізмом, і завжди прагнемо до того, щоб задовольнити потреби наших клієнтів. Якщо ви шукаєте свіжу, якісну рибу, звертайтеся до Aquapeak - ми завжди раді допомогти вам зробити правильний вибір!</span>
            </div>
        </>
    );
}

export default About; 