import Navigation from '../organisms/Navigation';
import Text from '../atoms/Text';

import imageArticle_01 from '../../assets/images/team.jpg';
import imageArticle_02 from '../../assets/images/work.jpg';
import imageArticle_03 from '../../assets/images/about_page.jpg';

import './about.scss';

const contentArticles = [
    { header: 'Наша команда', text: ['Команда нашої компанії, яка займається продажем свіжої риби, - це злагоджений колектив професіоналів з глибокими знаннями і досвідом в рибній індустрії. Наша місія - забезпечити наших клієнтів найкращою якістю риби та надати бездоганний обслуговування.', 'Наша команда має спільну мету - надавати клієнтам найкращу рибу та послуги, щоб вони могли насолоджуватися смачними і здоровими стравами в затишку свого дому. Ми прагнемо до постійного удосконалення і зростання, щоб завжди залишатися найкращими у справі, яку ми робимо - пропонувати свіжу рибу для наших клієнтів.'], image: imageArticle_01, side: 'left' },
    { header: 'Про роботу', text: ['Наша компанія, яка спеціалізується на продажу свіжої риби, - це місце, де робота поєднується з природою та гастрономічною магією морського світу. Робота в нашій компанії - це не просто трудовий процес, а справжній шлях до задоволення від того, що ми робимо.', 'Робота в нашій компанії - це можливість поєднати професійні і особисті інтереси, сприяти здоровому способу життя та приносити користь суспільству. Ми прагнемо досягати виняткових результатів та завжди раді вітати нових членів нашої команди, які поділяють нашу пристрасть до рибної індустрії.'], image: imageArticle_02, side: 'right' },
    { header: 'Рибка', text: ['Наш товар - це не просто свіжа риба, це риба, яка ще вчора дихала атмосферний повітря океану або моря. Ми пишаємося тим, що надаємо нашим клієнтам доступ до найвищої якості рибної продукції, яка максимально наближена до свого природного стану.', 'Коли ви замовляєте рибу в нашому інтернет-магазині, ви можете бути впевнені, що отримуєте продукт найвищої якості, який дихав свіжим повітрям природи і готовий додати найкращі смакові нотки до ваших страв.'], image: imageArticle_03, side: 'left' }
]

const About = () => {
    return (
        <>
            <Navigation />
            <div className="container-aboutus">
                {
                    contentArticles.map((article, index) => (
                        <div className="wrapper-article" key={index}>
                            <div className="article-header">{article.header}</div>
                            <div className="article-content">
                                <div className="content-image">
                                    <img src={article.image} alt="" />
                                </div>
                                <div className="content-text">
                                    <Text contents={article.text} />
                                </div>
                            </div>
                        </div>
                    ))
                }
            </div>
        </>
    );
}

export default About; 